{
  "base_model_name_or_path": "google/gemma-2b",
  "bias": "none",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
    "gate_proj",
    "up_proj",
    "down_proj"
  ],
  "alpha": 16,
  "lora_dropout": 0.05,
  "task_type": "CAUSAL_LM"
}
